[
    {
        "name": "Roast chicken thighs with brown rice & salsa verde",
        "url": "https://www.bbcgoodfood.com/recipes/roast-chicken-thighs-brown-rice-salsa-verde",
        "description": "How about a healthy, low-calorie roast chicken dinner? Enjoy this tasty meal with benefits like vitamin C from the salsa verde which helps iron absorbtion",

        "name": "Warm chicken salad",
        "url": "https://www.bbcgoodfood.com/recipes/warm-chicken-salad",
        "description": "This chicken salad recipe makes a lovely main meal for a hot day, or take some to work and be the envy of your colleagues",
        "ingredients": [
            "2 chicken breasts, cut into bite-size pieces",
            "½ small baguette, cut into bite-size pieces",
            "4 tbsp olive oil",
            "1 tbsp balsamic vinegar",
            "150g bag  mixed salad leaves",
            "1 x 250g pack cooked beetroot, cut into bite-size pieces",
            "100g goat's cheese"
        ],
        "steps": [
            "Heat oven to 200C/fan 180C/gas 6. Spread the chunks of chicken and baguette over a shallow roasting tray. Drizzle with 2 tbsp olive oil and toss to coat. Season, then put in the oven for 15 mins until the chicken is cooked through and the bread is golden and crisp.",
            "Whisk together the remaining olive oil and balsamic vinegar to make a dressing. Split the bag of leaves between two serving plates, add the beetroot, then scatter the cheese over. Toss with the warm chicken and bread, drizzle with the dressing, then serve straight away."
        ],
        "nutrients": {},
        "times": {
            "Preparation": "5 mins",
            "Cooking": "15 mins"
        },
        "serves": 2,
        "dish_type": "Warm salad dressings",
        "maincategory": "health"
    },
    {
        "name": "Caramelised onion & goat's cheese pizza",
        "url": "https://www.bbcgoodfood.com/recipes/caramelised-onion-goats-cheese-pizza",
        "description": "Make a veggie pizza that's healthy and low-fat instead of ordering a takeaway. This easy recipe uses goat's cheese for tang while the onions give it sweetness",

        "ingredients": [
            "3 skinless boneless chicken thighs, cut in half",
            "2 tbsp rapeseed oil",
            "2 garlic cloves, bashed",
            "½ small pack coriander",
            "½ small pack parsley",
            "1 anchovy fillet",
            "½ tbsp capers",
            "½ lemon, zested and juiced",
            "200g pouch cooked wholegrain rice",
            "200g baby leaf spinach"
        ],
        "steps": [
            "Heat oven to 200C/180C fan/gas 6. Season the chicken, rub with ½ tbsp oil, then put in a large roasting tin with the garlic and roast for 25-30 mins.",
            "Meanwhile, blitz the herbs, anchovy, capers, lemon juice and remaining oil with some seasoning in a food processor until finely chopped. Set aside.",
            "Once the chicken is cooked, remove the tin from the oven and squeeze the garlic out of their skins. Tip in the rice and use a wooden spoon to break it up, then add the spinach and lemon zest and toss. Return to the oven for 5 mins. Divide between bowls and dollop on the salsa verde."
        ],
        "nutrients": {
            "kcal": "423",
            "fat": "19g",
            "saturates": "3g",
            "carbs": "29g",
            "sugars": "1g",
            "fibre": "5g",
            "protein": "31g",
            "salt": "1.1g"
        },
        "times": {
            "Preparation": "10 mins",
            "Cooking": "35 mins"
        },
        "serves": 2,
        "dish_type": "Chicken thigh recipes",
        "maincategory": "recipes"
    }
]