[
    {
        "name": "Warm chicken salad",
        "url": "https://www.bbcgoodfood.com/recipes/warm-chicken-salad",
        "description": "This chicken salad recipe makes a lovely main meal for a hot day, or take some to work and be the envy of your colleagues",
        "ingredients": [
            "2 chicken breasts, cut into bite-size pieces",
            "½ small baguette, cut into bite-size pieces",
            "4 tbsp olive oil",
            "1 tbsp balsamic vinegar",
            "150g bag  mixed salad leaves",
            "1 x 250g pack cooked beetroot, cut into bite-size pieces",
            "100g goat's cheese"
        ],
        "steps": [
            "Heat oven to 200C/fan 180C/gas 6. Spread the chunks of chicken and baguette over a shallow roasting tray. Drizzle with 2 tbsp olive oil and toss to coat. Season, then put in the oven for 15 mins until the chicken is cooked through and the bread is golden and crisp.",
            "Whisk together the remaining olive oil and balsamic vinegar to make a dressing. Split the bag of leaves between two serving plates, add the beetroot, then scatter the cheese over. Toss with the warm chicken and bread, drizzle with the dressing, then serve straight away."
        ],
        "nutrients": {},
        "times": {
            "Preparation": "5 mins",
            "Cooking": "15 mins"
        },
        "serves": 2,
        "dish_type": "Warm salad dressings",
        "maincategory": "health"
    },
    {
        "name": "Caramelised onion & goat's cheese pizza",
        "url": "https://www.bbcgoodfood.com/recipes/caramelised-onion-goats-cheese-pizza",
        "description": "Make a veggie pizza that's healthy and low-fat instead of ordering a takeaway. This easy recipe uses goat's cheese for tang while the onions give it sweetness",
        "ingredients": [
            "3 skinless boneless chicken thighs, cut in half",
            "2 tbsp rapeseed oil",
            "2 garlic cloves, bashed",
            "½ small pack coriander",
            "½ small pack parsley",
            "1 anchovy fillet",
            "½ tbsp capers",
            "½ lemon, zested and juiced",
            "200g pouch cooked wholegrain rice",
            "200g baby leaf spinach"
        ],
        "steps": [
            "Heat oven to 200C/180C fan/gas 6. Season the chicken, rub with ½ tbsp oil, then put in a large roasting tin with the garlic and roast for 25-30 mins.",
            "Meanwhile, blitz the herbs, anchovy, capers, lemon juice and remaining oil with some seasoning in a food processor until finely chopped. Set aside.",
            "Once the chicken is cooked, remove the tin from the oven and squeeze the garlic out of their skins. Tip in the rice and use a wooden spoon to break it up, then add the spinach and lemon zest and toss. Return to the oven for 5 mins. Divide between bowls and dollop on the salsa verde."
        ],
        "nutrients": {
            "kcal": "423",
            "fat": "19g",
            "saturates": "3g",
            "carbs": "29g",
            "sugars": "1g",
            "fibre": "5g",
            "protein": "31g",
            "salt": "1.1g"
        },
        "times": {
            "Preparation": "10 mins",
            "Cooking": "35 mins"
        },
        "serves": 2,
        "dish_type": "Chicken thigh recipes",
        "maincategory": "recipes"
    },
    {
        "name": "Caramelised onion & goat's cheese pizza",
        "url": "https://www.bbcgoodfood.com/recipes/caramelised-onion-goats-cheese-pizza",
        "description": "Make a veggie pizza that's healthy and low-fat instead of ordering a takeaway. This easy recipe uses goat's cheese for tang while the onions give it sweetness",
        "ingredients": [
            "125g wholemeal flour, plus a little for kneading if necessary",
            "½ tsp instant yeast",
            "pinch of salt",
            "1 tsp rapeseed oil, plus extra for greasing",
            "2 onions, halved and thinly sliced",
            "2 tsp rapeseed oil",
            "2 tsp balsamic vinegar",
            "160g baby spinach leaves (not the very tiny ones), chopped",
            "2 large garlic cloves, finely grated",
            "50g soft goat's cheese",
            "4 pitted Kalamata olives, quartered",
            "few soft thyme leaves",
            "1 tsp sunflower seeds"
        ],
        "steps": [
            "Heat oven to 220C/200C fan/gas 7. Tip the flour into a mixer with a dough hook, or a bowl. Add the yeast, salt, oil and just under 100ml warm water then mix to a soft dough. Knead in the food mixer for about 5 mins, but if making this by hand, tip onto a work surface and knead for about 10 mins. The dough is sticky, but try not to add too much extra flour. Leave in the bowl and cover with a tea towel while you make the topping. There is no need to let the dough prove for a specific time – just let it sit while you get on with the next step.",
            "Tip the onions into a non-stick wok and add the oil, 4 tbsp water and balsamic vinegar. Cover with a saucepan lid that sits inside the pan to help the onions soften, then cook for 15 mins, stirring about 3 times and replacing the lid quickly so as not to lose too much moisture. After the time is up, the onions should be golden and all the liquid gone. Tip onto a plate. Add the spinach and garlic to the pan and stir-fry until the spinach has wilted.",
            "Take the dough from the bowl and cut in half with an oiled knife, then press each piece into a 25-15 cm oval on a large greased baking sheet with oiled hands. Don’t knead the dough first otherwise it will be too elastic and it will keep shrinking back.",
            "Spread with the spinach followed by the onions, then dot with the cheese and scatter with the olives, thyme and sunflower seeds. Bake for 15 mins until golden and the base is cooked through."
        ],
        "nutrients": {
            "kcal": "443",
            "fat": "14g",
            "saturates": "5g",
            "carbs": "54g",
            "sugars": "9g",
            "fibre": "11g",
            "protein": "18g",
            "salt": "0.9g"
        },
        "times": {
            "Preparation": "20 mins",
            "Cooking": "30 mins"
        },
        "serves": 2,
        "dish_type": "Goat's cheese recipes",
        "maincategory": "recipes"
    },
    {
        "name": "Coriander roast chicken thighs with puy lentil salad",
        "url": "https://www.bbcgoodfood.com/recipes/coriander-roast-chicken-thighs-with-puy-lentil-salad",
        "description": "Rustle up this coriander chicken with puy lentil salad after a workout – a clever balance of protein and nutrient-dense carbs makes it an ideal post-exercise meal",
        "ingredients": [
            "185g puy lentils",
            "20g ginger, peeled",
            "30g  coriander, plus extra leaves to serve",
            "1 tsp each garam masala and ground coriander",
            "1⁄2 tsp ground cumin",
            "2 large whole garlic cloves, plus 1 small clove, finely grated",
            "2 tbsp lemon juice",
            "150g pot  plain bio yogurt",
            "6 bone-in, skinless chicken thighs",
            "1 tbsp fresh turmeric, finely grated",
            "1 tbsp rapeseed or olive oil, plus 1 tsp",
            "3 red onions (325g), thickly sliced",
            "1 large red pepper and 1 large yellow pepper, deseeded and cut into chunks",
            "400g cauliflower, cut into small florets",
            "1 tsp cumin seeds"
        ],
        "steps": [
            "Heat the oven to 220C/200C fan/ gas 7. Boil the lentils for 35-40 mins over a medium heat until tender.",
            "Meanwhile, put the ginger, fresh coriander, garam masala, the ground coriander, ground cumin and the 2 whole garlic cloves in a large bowl with half the lemon juice and 3 tbsp of the yogurt. Blitz using a hand blender until smooth. Use 4 tbsp of the mixture to coat the chicken thighs in a large bowl. Arrange the chicken on a baking tray in a single layer.",
            "Add the remaining yogurt to the remaining spice and herb mixture, along with the turmeric, 1 tsp oil, the grated garlic, 1 tbsp water and remaining lemon juice to taste. Set aside.",
            "Tip the onions, peppers and cauliflower into the bowl used for the chicken, and toss with 1 tbsp oil to coat in some of the spice mix. Spread the veg out on a baking tray, then put in the oven with the chicken for 30-35 mins until the chicken is cooked through.",
            "Remove the chicken and wrap in foil to keep it warm. Scatter the cumin seeds over the veg and return to the oven for 5 mins until golden.",
            "To serve, drain the lentils and put in a serving bowl with the roasted veg and the remaining turmeric yogurt. Gently toss together. Serve with the chicken (taking the meat off the bones), and scatter with the extra coriander. If you're following the Healthy Diet Plan, eat half and pack up the rest to eat cold another day. Will keep chilled for up to three days or frozen for up to a month."
        ],
        "nutrients": {
            "kcal": "419",
            "fat": "13g",
            "saturates": "3g",
            "carbs": "36g",
            "sugars": "14g",
            "fibre": "12g",
            "protein": "33g",
            "salt": "0.3g"
        },
        "times": {
            "Preparation": "20 mins",
            "Cooking": "45 mins"
        },
        "serves": 4,
        "dish_type": "Dinner-to-lunch recipes",
        "maincategory": "recipes"
    },
    {
        "name": "Egg & rocket pizzas",
        "url": "https://www.bbcgoodfood.com/recipes/egg-rocket-pizzas",
        "description": "Use seeded tortillas as pizza bases for a quick and healthy lunch - crack an egg in the centre and bake to boost protein intake",
        "ingredients": [
            "2 seeded wraps",
            "a little olive oil, for brushing",
            "1 roasted red pepper, from a jar",
            "2 tomatoes",
            "2 tbsp tomato purée",
            "1 tbsp chopped dill",
            "2 tbsp chopped parsley",
            "2 eggs",
            "65g pack  rocket",
            "½ red onion, very thinly sliced "
        ],
        "steps": [
            "Heat oven to 200C/180C fan/gas 6. Lay the tortillas on two baking sheets, brush sparingly with the oil then bake for 3 mins. Meanwhile chop the pepper and tomatoes and mix with the tomato purée, seasoning and herbs. Turn the tortillas over and spread with the tomato mixture, leaving the centre free from any large pieces of pepper or tomato.",
            "Break an egg into the centre then return to the oven for 10 mins or until the egg is just set and the tortilla is crispy round the edges. Serve scattered with the rocket and onion."
        ],
        "nutrients": {
            "kcal": "327",
            "fat": "11g",
            "saturates": "3g",
            "carbs": "39g",
            "sugars": "8g",
            "fibre": "5g",
            "protein": "15g",
            "salt": "1g"
        },
        "times": {
            "Preparation": "10 mins",
            "Cooking": "15 mins - 20 mins"
        },
        "serves": 2,
        "dish_type": "Quick lunch recipes",
        "maincategory": "recipes"
    },
    {
        "name": "Egg & rocket pizzas",
        "url": "https://www.bbcgoodfood.com/recipes/egg-rocket-pizzas",
        "description": "Use seeded tortillas as pizza bases for a quick and healthy lunch - crack an egg in the centre and bake to boost protein intake",
        "ingredients": [
            "2 seeded wraps",
            "a little olive oil, for brushing",
            "1 roasted red pepper, from a jar",
            "2 tomatoes",
            "2 tbsp tomato purée",
            "1 tbsp chopped dill",
            "2 tbsp chopped parsley",
            "2 eggs",
            "65g pack  rocket",
            "½ red onion, very thinly sliced "
        ],
        "steps": [
            "Heat oven to 200C/180C fan/gas 6. Lay the tortillas on two baking sheets, brush sparingly with the oil then bake for 3 mins. Meanwhile chop the pepper and tomatoes and mix with the tomato purée, seasoning and herbs. Turn the tortillas over and spread with the tomato mixture, leaving the centre free from any large pieces of pepper or tomato.",
            "Break an egg into the centre then return to the oven for 10 mins or until the egg is just set and the tortilla is crispy round the edges. Serve scattered with the rocket and onion."
        ],
        "nutrients": {
            "kcal": "327",
            "fat": "11g",
            "saturates": "3g",
            "carbs": "39g",
            "sugars": "8g",
            "fibre": "5g",
            "protein": "15g",
            "salt": "1g"
        },
        "times": {
            "Preparation": "10 mins",
            "Cooking": "15 mins - 20 mins"
        },
        "serves": 2,
        "dish_type": "Quick lunch recipes",
        "maincategory": "recipes"
    }
]